crlhz/stm32-7seg-clock/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define seg2_Pin GPIO_PIN_0
#define seg2_GPIO_Port GPIOC
#define seg3_Pin GPIO_PIN_1
#define seg3_GPIO_Port GPIOC
#define seg0_Pin GPIO_PIN_0
#define seg0_GPIO_Port GPIOA
#define seg1_Pin GPIO_PIN_1
#define seg1_GPIO_Port GPIOA
#define clock0_Pin GPIO_PIN_0
#define clock0_GPIO_Port GPIOB
#define clock1_Pin GPIO_PIN_1
#define clock1_GPIO_Port GPIOB
#define clock2_Pin GPIO_PIN_2
#define clock2_GPIO_Port GPIOB
#define s1_Pin GPIO_PIN_8
#define s1_GPIO_Port GPIOA
#define s1_EXTI_IRQn EXTI9_5_IRQn
#define s0_Pin GPIO_PIN_10
#define s0_GPIO_Port GPIOA
#define s0_EXTI_IRQn EXTI15_10_IRQn
#define clock3_Pin GPIO_PIN_3
#define clock3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
